FVM_WD/Pipe_3D/Pipe_3D_linear_solver_convergence_rate/compressible/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          352;
        startFace       74528;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2304;
        startFace       74880;
    }
    outlet
    {
        type            patch;
        nFaces          352;
        startFace       77184;
    }
)

// ************************************************************************* //
