FVM_WD/Pipe_3D/Pipe_3D_linear_solver_convergence_rate/compressible/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;
solver          fluid;
startFrom       startTime;
startTime       0.0;
stopAt          endTime;
endTime         0.01;
deltaT          5.0e-4;		//Stable with nCorrectors 2;
writeControl    adjustableRunTime; //runTime
writeInterval   0.005;
purgeWrite      0;
writeFormat     binary;
writePrecision  12;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;

maxCo           1;
maxDeltaT       0.01;

// ************************************************************************* //