FVM_WD/Pipe_3D/Pipe_3D_linear_solver_convergence_rate/compressible/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type       limitPressure;

    minFactor  0.2;	//0.5
    maxFactor  5;	//2
}

limitT
{
//These options are not used in this new setup

    active          son;
    timeStart       s0;
    duration        s1;	//0.1-1

    type       limitTemperature;

    min        100;
    max        1000;

    selectionMode all;
}

//************************************************************************** //

