FVM_WD/Pipe_3D/Pipe_3D_linear_solver_convergence_rate/compressible/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
	    solver          PCG;
        preconditioner  FDIC; //DIC FDIC diagonal GAMG
        tolerance       1e-06;
        relTol          0.01;
        minIter         3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "rho.*"
    {
        solver diagonal;
    }

    "(U|h).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	    minIter		    3;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 2;
    nCorrectors     3;
    nNonOrthogonalCorrectors 2;

    /*
    outerCorrectorResidualControl
    {
        "(U|k|epsilon)"
        {
            relTol         1e-2;
            tolerance      1e-3;
        }
        p               1e-4;
    }
    */
}

relaxationFactors
{
    fields
    {
        ".*"   0.9;
    }
    
    equations
    {
        ".*"   0.9;
    }
}

// ************************************************************************* //
